# На вход подаётся картинка
# Проверить ориентацию картинки и при необходимости развернуть её
# Определить на картинке изображено лицо или отдельная часть
# Передать картинку в нужную сеть для классификации
# Сохранить картинку в целевой деректории с верными параметрами


# Задача 1: Создать или преобразовать картинку к правильному формату
# Задача 2: Классифицировать картинку по профилю
# Задача 2.1: Собрать трансформатор изображений для приведения к нужному формату и размеру
# Задача 2.2: Выделить контур изображения
# Задача 2.3: Подготовить обучающие выборки для МЗ

