# На вход подаётся картинка
# Проверить ориентацию картинки и при необходимости развернуть её (OpenCV)
## Изображение человека всегда и горизонтальное и вертикальное, челюстей всегда горизонтальное
## Найти глаза и повернуть так, что бы они были в верхней половине изображения
# Определить на картинке изображено лицо или отдельная часть (OpenCV)
# Передать картинку в нужную сеть для классификации (TF? Keras?)
# Сохранить картинку в целевой деректории с верными параметрами


# Задача 1: Создать или преобразовать картинку к правильному формату
# Задача 2: Классифицировать картинку по профилю
# Задача 2.1: Собрать трансформатор изображений для приведения к нужному формату и размеру
# Задача 2.2: Выделить контур изображения
# Задача 2.3: Подготовить обучающие выборки для МЗ

import cv2


